ImpressiveTaste/dsPIC33EP256MP506-motroBench-Hurst075-reference-MCLV2/all/sample-mb-33ep256mc506-mclv2.X/mcc_generated_files/pwm.h
    PWM_MasterDutyCycleSet(masterDutyCycle);
    </code>
*/
inline static void PWM_MasterDutyCycleSet(uint16_t masterDutyCycle)
{
    MDC = masterDutyCycle;
}

/**
  @Summary
    Sets the period value in count for the PWM generator specific Time Base.

  @Description
    This routine is used to set the period value in count for the PWM generator specific Time Base.

  @Param
    genNum  - PWM generator number.
    period  - Period value in count.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t period;

    period = 0xFF;
    
    genNum = PWM_GENERATOR_1;
    PWM_PeriodSet(genNum, period);
    </code>
*/  
inline static void PWM_PeriodSet(PWM_GENERATOR genNum, uint16_t period)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                PHASE1 = period;                
                break;       
        case MOTOR1_PHASE_B:
                PHASE2 = period;                
                break;       
        case MOTOR1_PHASE_C:
                PHASE3 = period;                
                break;       
        default:break;  
    }
}

/**
  @Summary
    Sets the PWM duty cycle value in count for the PWM Generator.

  @Description
    This routine is used to set the PWM duty cycle value in count for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum      - PWM generator number.
    dutyCycle   - Duty cycle value in count.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t dutyCycle;

    dutyCycle = 0xFF;
    
    genNum = PWM_GENERATOR_1;
    PWM_DutyCycleSet(genNum, dutyCycle);
    </code>
*/  
inline static void PWM_DutyCycleSet(PWM_GENERATOR genNum, uint16_t dutyCycle)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                PDC1 = dutyCycle;                
                break;       
        case MOTOR1_PHASE_B:
                PDC2 = dutyCycle;                
                break;       
        case MOTOR1_PHASE_C:
                PDC3 = dutyCycle;                
                break;       
        default:break;  
    }
}

/**
  @Summary
    Updates PWM override data bits with the requested value for the PWM Generator.

  @Description
    This routine is used to updates PWM override data bits with the requested 
    value for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    overrideData    - Override data

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t overrideData;

    overrideData = 0x01;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideDataSet(genNum, overrideData);
    </code>
*/  
inline static void PWM_OverrideDataSet(PWM_GENERATOR genNum, uint16_t overrideData)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON1 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON1, overrideData, &PWMKEY); 
                break;       
        case MOTOR1_PHASE_B:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON2 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON2, overrideData, &PWMKEY); 
                break;       
        case MOTOR1_PHASE_C:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON3 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON3, overrideData, &PWMKEY); 
                break;       
        default:break;  
    }
}

/**
  @Summary
    Updates PWM override high data bit with the requested value for the PWM 
    Generator.

  @Description
    This routine is used to update PWM override high data bit with the 
    requested value for the PWM Generator selected by the argument 
    PWM_GENERATOR.

  @Param
    genNum              - PWM generator number.
    overrideDataHigh    - Override data

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    bool overrideDataHigh;

    overrideDataHigh = true;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideDataHighSet(genNum, overrideDataHigh);
    </code>
*/  
inline static void PWM_OverrideDataHighSet(PWM_GENERATOR genNum, bool overrideDataHigh)
{
    uint16_t overrideData;
    
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON1 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON1, overrideData, &PWMKEY);
                break;       
        case MOTOR1_PHASE_B:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON2 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON2, overrideData, &PWMKEY);
                break;       
        case MOTOR1_PHASE_C:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON3 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON3, overrideData, &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Updates PWM override low data bit with the requested value 
    for the PWM Generator.

  @Description
    This routine is used to update PWM override low data bit with the requested 
    value for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum              - PWM generator number.
    overrideDataLow     - Override data

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    bool overrideDataLow;

    overrideDataLow = true;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideDataLowSet(genNum, overrideDataLow);
    </code>
*/  
inline static void PWM_OverrideDataLowSet(PWM_GENERATOR genNum, bool overrideDataLow)
{
    uint16_t overrideData;
    
