ImpressiveTaste/dsPIC33EP256MP506-motroBench-Hurst075-reference-MCLV2/all/sample-mb-33ep256mc506-mclv2.X/mcc_generated_files/pwm.h
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON1 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON1, overrideData, &PWMKEY);
                break;       
        case MOTOR1_PHASE_B:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON2 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON2, overrideData, &PWMKEY);
                break;       
        case MOTOR1_PHASE_C:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON3 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON3, overrideData, &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Gets PWM override value for the PWM Generator.

  @Description
    This routine is used to get PWM override value for the PWM Generator 
    selected by the argument PWM_GENERATOR.
	
  @Param
    genNum          - PWM generator number.

  @Returns
    Override data for the PWM Generator selected by the argument PWM_GENERATOR.
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t overrideData;
    
    genNum = PWM_GENERATOR_1;
    overrideData = PWM_OverrideDataGet(genNum, overrideData);
    </code>
*/
inline static uint16_t PWM_OverrideDataGet(PWM_GENERATOR genNum)
{
    uint16_t overrideData;
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                overrideData = IOCON1bits.OVRDAT;                 
                break;       
        case MOTOR1_PHASE_B:
                overrideData = IOCON2bits.OVRDAT;                 
                break;       
        case MOTOR1_PHASE_C:
                overrideData = IOCON3bits.OVRDAT;                 
                break;       
        default:break;  
    }
    return overrideData;
}

/**
  @Summary
    Enables PWM override on PWMH output for the PWM Generator.

  @Description
    This routine is used to enable PWM override on PWMH output for the 
    PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideHighEnable(genNum);
    </code>
*/  
inline static void PWM_OverrideHighEnable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                __builtin_write_PWMSFR(&IOCON1, (IOCON1 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case MOTOR1_PHASE_B:
                __builtin_write_PWMSFR(&IOCON2, (IOCON2 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case MOTOR1_PHASE_C:
                __builtin_write_PWMSFR(&IOCON3, (IOCON3 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        default:break;  
    }
}

/**
  @Summary
    Enables PWM override on PWML output for the PWM Generator.

  @Description
    This routine is used to enable PWM override on PWML output for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideLowEnable(genNum);
    </code>
*/  
inline static void PWM_OverrideLowEnable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                __builtin_write_PWMSFR(&IOCON1, (IOCON1 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case MOTOR1_PHASE_B:
                __builtin_write_PWMSFR(&IOCON2, (IOCON2 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case MOTOR1_PHASE_C:
                __builtin_write_PWMSFR(&IOCON3, (IOCON3 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Disables PWM override on PWMH output for the PWM Generator.

  @Description
    This routine is used to disable PWM override on PWMH output for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideHighDisable(genNum);
    </code>
*/  
inline static void PWM_OverrideHighDisable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                __builtin_write_PWMSFR(&IOCON1, (IOCON1 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case MOTOR1_PHASE_B:
                __builtin_write_PWMSFR(&IOCON2, (IOCON2 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case MOTOR1_PHASE_C:
                __builtin_write_PWMSFR(&IOCON3, (IOCON3 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Disables PWM override on PWML output for the PWM Generator.

  @Description
    This routine is used to disable PWM override on PWML output for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideLowDisable(genNum);
    </code>
*/  
inline static void PWM_OverrideLowDisable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                __builtin_write_PWMSFR(&IOCON1, (IOCON1 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case MOTOR1_PHASE_B:
                __builtin_write_PWMSFR(&IOCON2, (IOCON2 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case MOTOR1_PHASE_C:
                __builtin_write_PWMSFR(&IOCON3, (IOCON3 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Updates PWM Deadtime low register with the requested value for a specific PWM generator.

  @Description
    This routine is used to updates PWM Deadtime low register with the requested 
    value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum      - PWM generator number.
    deadtimeLow - Deadtime low value.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t deadtimeLow;

    deadtimeLow = 0x01;
    
    PWM_DeadTimeLowSet(PWM_GENERATOR_1, deadtimeLow);
    </code>
*/  
inline static void PWM_DeadTimeLowSet(PWM_GENERATOR genNum, uint16_t deadtimeLow)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                DTR1 = deadtimeLow;                
                break;          
        case MOTOR1_PHASE_B:
                DTR2 = deadtimeLow;                
                break;          
        case MOTOR1_PHASE_C:
                DTR3 = deadtimeLow;                
                break;          
        default:break;  
    }
}

/**
  @Summary
    Updates PWM Deadtime high register with the requested value for a specific PWM generator.

  @Description
    This routine is used to updates PWM Deadtime high register with the requested 
    value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    deadtimeHigh    - Deadtime high value.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t deadtimeHigh;

    deadtimeHigh = 0x01;
    
    PWM_DeadTimeHighSet(PWM_GENERATOR_1, deadtimeHigh);
    </code>
*/  
inline static void PWM_DeadTimeHighSet(PWM_GENERATOR genNum, uint16_t deadtimeHigh)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                ALTDTR1 = deadtimeHigh;                
                break;   
        case MOTOR1_PHASE_B:
                ALTDTR2 = deadtimeHigh;                
                break;   
        case MOTOR1_PHASE_C:
                ALTDTR3 = deadtimeHigh;                
                break;   
        default:break;  
    }
}

/**
  @Summary
    Updates PWM Deadtime low and high register with the requested value for a specific PWM generator.

  @Description
    This routine is used to updates PWM Deadtime low and high register with the 
    requested value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    deadtimeHigh    - Deadtime value.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t deadtime;

    deadtime = 0x01;
    
    PWM_DeadTimeHighSet(PWM_GENERATOR_1, deadtime);
    </code>
*/  
inline static void PWM_DeadTimeSet(PWM_GENERATOR genNum, uint16_t deadtime)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
                DTR1 = deadtime; 
                ALTDTR1 = deadtime;				
                break;   
        case MOTOR1_PHASE_B:
                DTR2 = deadtime; 
                ALTDTR2 = deadtime;				
                break;   
        case MOTOR1_PHASE_C:
                DTR3 = deadtime; 
                ALTDTR3 = deadtime;				
                break;   
        default:break;  
    }
}

/**
  @Summary
    Sets the PWM trigger compare value in count for the PWM Generator.

  @Description
    This routine is used to set the PWM trigger compare value in count 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    trigCompValue   - Trigger compare value in count.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t trigCompValue;

    trigCompValue = 0x01;
    
    genNum = PWM_GENERATOR_1;
    PWM_TriggerCompareValueSet(genNum, trigCompValue);
    </code>
*/  
inline static void PWM_TriggerCompareValueSet(PWM_GENERATOR genNum, uint16_t trigCompValue)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A: 
                TRIG1 = trigCompValue;               
                break;       
        case MOTOR1_PHASE_B: 
                TRIG2 = trigCompValue;               
                break;       
        case MOTOR1_PHASE_C: 
                TRIG3 = trigCompValue;               
                break;       
        default:break;  
    }
}

/**
  @Summary
    Enables interrupt requests for the PWM Generator.

  @Description
    This routine is used to enable interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.
    interrupt - PWM generator interrupt source.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    PWM_GENERATOR_INTERRUPT interrupt;
    
    genNum = PWM_GENERATOR_1;
    interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
    PWM_GeneratorInterruptEnable(genNum, interrupt);
    </code>
*/ 
inline static void PWM_GeneratorInterruptEnable(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON1bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON1bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON1bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case MOTOR1_PHASE_B:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON2bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON2bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON2bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case MOTOR1_PHASE_C:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON3bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON3bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON3bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        default:break;  
    }
}

/**
  @Summary
    Disables interrupt requests for the PWM Generator.

  @Description
    This routine is used to disables interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.
    interrupt - PWM generator interrupt source.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    PWM_GENERATOR_INTERRUPT interrupt;
    
    genNum = PWM_GENERATOR_1;
    interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
    PWM_GeneratorInterruptDisable(genNum, interrupt);
    </code>
*/ 
inline static void PWM_GeneratorInterruptDisable(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON1bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON1bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON1bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case MOTOR1_PHASE_B:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON2bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON2bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON2bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case MOTOR1_PHASE_C:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON3bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON3bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON3bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        default:break;  
    }
}

/**
  @Summary
    Clears PWM interrupt status for the PWM Generator.

  @Description
    This routine is used to clear PWM interrupt status for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.
    interrupt - PWM generator interrupt source.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    PWM_GENERATOR_INTERRUPT interrupt;
    
    genNum = PWM_GENERATOR_1;
    interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
    PWM_GeneratorEventStatusClear(genNum, interrupt);
    </code>
*/
inline static void PWM_GeneratorEventStatusClear(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
{
    switch(genNum) { 
        case MOTOR1_PHASE_A:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON1bits.FLTIEN = false;
							PWMCON1bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON1bits.CLIEN = false;
							PWMCON1bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON1bits.TRGIEN = false;
							PWMCON1bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case MOTOR1_PHASE_B:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON2bits.FLTIEN = false;
							PWMCON2bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON2bits.CLIEN = false;
							PWMCON2bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON2bits.TRGIEN = false;
							PWMCON2bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case MOTOR1_PHASE_C:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON3bits.FLTIEN = false;
							PWMCON3bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON3bits.CLIEN = false;
							PWMCON3bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON3bits.TRGIEN = false;
							PWMCON3bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        default:break;  
    }
}

/**
  @Summary
    Gets PWM interrupt status for the PWM Generator.

  @Description
    This routine is used to get PWM interrupt status for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.
    interrupt - PWM generator interrupt source.

  @Returns
    true - Interrupt is pending.
	false - Interrupt is not pending.
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    PWM_GENERATOR_INTERRUPT interrupt;
    bool status;
    
    genNum = PWM_GENERATOR_1;
    interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
    status = PWM_GeneratorEventStatusGet(genNum, interrupt);
    </code>
*/
inline static bool PWM_GeneratorEventStatusGet(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
{
    bool status = false;
	
